backend/controllers/AjusteController.php

SELECT * FROM `ajuste` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Ajuste::findOne(['id' => $id])) !== null) {