backend/controllers/EstadoController.php

    protected function findModel($id)
    {
        if (($model = Estado::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `estado` WHERE `id`='1'