backend/controllers/PreregistroController.php

    protected function findModel($id)
    {
        if (($model = Preregistro::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `preregistro` WHERE `id`='25'