backend/controllers/SiteController.php

SELECT `estado_proyecto_id`, COUNT(*) AS `count` FROM `proyecto` GROUP BY `estado_proyecto_id`
SELECT COUNT(*) FROM `proyecto`
SELECT COUNT(*) FROM `asesor_interno`
SELECT `asesor_interno`.*, `ingenieria`.`nombre` AS `nombre_ingenieria` FROM `asesor_interno` LEFT JOIN `ingenieria` ON asesor_interno.ingenieria_id = ingenieria.id LIMIT 5
---
    public function actionIndex()
    {
        //Consulta de los proyectos en la base de datos
        $totalProjects = Proyecto::find()->count();
        // Consulta del numero de proyectos por estado
        $projectCounts = Proyecto::find()
            ->select(['estado_proyecto_id', 'COUNT(*) AS count'])
            ->groupBy('estado_proyecto_id')
            ->asArray()
            ->all();

        //Consulta de los numeros de docentes en la base de datos
        $totalTeachers = AsesorInterno::find()->count();

        //Paginancion para los resultados obtenidos de docente
        $pageSize = 5;

        $paginationTeachers = new Pagination([
            'defaultPageSize' => $pageSize,
            'totalCount' => $totalTeachers,
        ]);

        //Consulta de los docentes en la base de datos
        $teachers = AsesorInterno::find()
            ->select(['asesor_interno.*', 'ingenieria.nombre AS nombre_ingenieria'])
            ->leftJoin('ingenieria', 'asesor_interno.ingenieria_id = ingenieria.id')
            ->offset($paginationTeachers->offset)
            ->limit($paginationTeachers->limit)
            ->asArray() //Para trabajar con arrays en lugar de objetos
            ->all(); //Obtienen todo  los registros