backend/controllers/UsuarioPermisoController.php

    protected function findModel($id, $user_id, $permiso_id)
    {
        if (($model = UsuarioPermiso::findOne(['id' => $id, 'user_id' => $user_id, 'permiso_id' => $permiso_id])) !== null) {
---
SELECT * FROM `usuario_permiso` WHERE (`id`='10') AND (`user_id`='11') AND (`permiso_id`='2')