frontend/controllers/PreregistroController.php

    public function findModel($id)
    {
        if (($model = Preregistro::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `preregistro` WHERE `id`='29'


                        $rutaArchivoConstancia_ingles = "uploads/preregistro/ingles/".time()."_".$model->archivoConstancia_ingles->basename.".".$model->archivoConstancia_ingles->extension;

                        if(($model->archivoConstancia_ingles->saveAs($rutaArchivoConstancia_ingles)))
---
INSERT INTO `preregistro` (`nombre`, `matricula`, `email`, `ingenieria_id`, `kardex`, `constancia_ingles`, `cv`, `constancia_creditos_complementarios`, `seguro_medico`, `created_at`, `updated_at`) VALUES ('prueba_validacion', '20070063', 'prueba_validacion247@gmail.com', 6, 'uploads/preregistro/kardex/1728406356_Actividad 2 Analisis de puestos Des SW (caso) Grupo A.pdf', 'uploads/preregistro/ingles/1728406356_Actividad 2 Analisis de puestos Des SW (caso) Grupo A.pdf', 'uploads/preregistro/cv/1728406356_Actividad 2 Analisis de puestos Des SW (caso) Grupo A.pdf', 'uploads/preregistro/creditos_complementarios/1728406356_Actividad 2 Analisis de puestos Des SW (caso) Grupo A.pdf', 'uploads/preregistro/seguro_medico/1728406356_Actividad 2 Analisis de puestos Des SW (caso) Grupo A.pdf', NOW(), NOW())