frontend/controllers/PreregistroController.php

SELECT * FROM `preregistro` WHERE `matricula`='20070005'
---
    public function findModelByMatricula($matricula)
    {
        if (($model = Preregistro::findOne(['matricula' => $matricula])) !== null) {