frontend/controllers/SiteController.php

    public function findAjuste($id)
    {
        if (($model = Ajuste::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `ajuste` WHERE `id`=1