common/models/Preregistro.php

    public function getIngenieriasList()
    {
        $ingenierias = Ingenieria::find()->all();
---
SELECT * FROM `ingenieria`

    public function getEstadoRegistroNombreList()
    {
        $estadoRegistro = EstadoRegistro::find()->all();
---
SELECT * FROM `estado_registro`