common/models/Proyecto.php

SELECT * FROM `departamento`
---
    public function getDepartamentoList()
    {
        $departamento = Departamento::find()->all();

SELECT * FROM `ingenieria`
---
    public function getIngenieriasList()
    {
        $ingenierias = Ingenieria::find()->all();

SELECT * FROM `perfil_estudiante`
---
    public function getMatriculasList()
    {
        $matriculas = PerfilEstudiante::find()->all();