common/models/User.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'estado_id' =>  ValorHelpers::getEstadoId('Activo')]);
---
SELECT * FROM `user` WHERE (`id`=11) AND (`estado_id`=1)

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'estado_id' =>  ValorHelpers::getEstadoId('Activo')]);
---
SELECT * FROM `user` WHERE (`username`='fernando.uc') AND (`estado_id`=1)

    public static function getEstadoLista()
    {
        $dropciones = Estado::find()->asArray()->all();
---
SELECT * FROM `estado`

    public static function getTipoUsuarioLista()
    {
        $dropciones = TipoUsuario::find()->asArray()->all();
---
SELECT * FROM `tipo_usuario`