common/models/ValorHelpers.php

    public static function getUsersRolValor($userId = null, $rol_nombre)
    {
        // Si no se proporciona un userId, se usa el usuario autenticado
        if ($userId === null) {
            $userId = Yii::$app->user->id; // ID del usuario autenticado
        }

        // Buscar el registro en la tabla usuario_rol basado en el userId
        $usuarioRoles = UsuarioRol::find()
            ->where(['user_id' => $userId])
            ->all(); // Obtener todos los roles relacionados
---
SELECT * FROM `usuario_rol` WHERE `user_id` IS NULL

    public static function getUsersRolValorEspecifico($userId = null, $rol_nombre) {
        // Si no se proporciona un userId, se usa el usuario autenticado
        if ($userId === null) {
            $userId = Yii::$app->user->id; // ID del usuario autenticado
        }

        // Buscar el registro en la tabla usuario_rol basado en el userId
        $usuarioRoles = UsuarioRol::find()
            ->where(['user_id' => $userId])
            ->all(); // Obtener todos los roles relacionados
---
SELECT * FROM `usuario_rol` WHERE `user_id`=11

    public static function getRolValor($rol_nombre)
    {
        $rol = Rol::find('rol_valor')
            ->where(['rol_nombre' => $rol_nombre])
            ->one();
---
SELECT * FROM `rol` WHERE `rol_nombre`='Subdirector'

    public static function getPermisoValor($permiso_nombre)
    {
        $permiso = Permiso::find('permiso_valor')
            ->where(['permiso_nombre' => $permiso_nombre])
            ->one();
---
SELECT * FROM `permiso` WHERE `permiso_nombre`='CoordinadorSistemas'

    public static function esRolNombreValido($rol_nombre)
    {
        $rol = Rol::find('rol_nombre')
            ->where(['rol_nombre' => $rol_nombre])
            ->one();
---
SELECT * FROM `rol` WHERE `rol_nombre`='Subdirector'

    public static function getEstadoId($estado_nombre)
    {
        $estado = Estado::find('id')
            ->where(['estado_nombre' => $estado_nombre])
            ->one();
---
SELECT * FROM `estado` WHERE `estado_nombre`='Activo'