common/models/ValorHelpers.php

    public static function getUsersRolValor($userId = null)
    {
        // Si no se proporciona un userId, se usa el usuario autenticado
        if ($userId === null) {
            $userId = Yii::$app->user->id; // ID del usuario autenticado
        }

        // Buscar el registro en la tabla usuario_rol basado en el userId
        $usuarioRol = UsuarioRol::findOne(['user_id' => $userId]);
---
SELECT * FROM `rol` WHERE `id`=7

    public static function getEstadoId($estado_nombre)
    {
        $estado = Estado::find('id')
            ->where(['estado_nombre' => $estado_nombre])
            ->one();
---
SELECT * FROM `estado` WHERE `estado_nombre`='Activo'