backend/models/search/PreregistroSearch.php

    public function search($params)
    {
        $query = Preregistro::find();

        // add conditions that should always apply here

        // Agregar condiciones que siempre deben aplicarse aquí

        $id_user = Yii::$app->user->identity->getId();
        if ($id_user !== null) {
            // Buscar todos los permisos del usuario
            $userPermisos = UsuarioPermiso::findAll(['user_id' => $id_user]);
---
SELECT * FROM `usuario_permiso` WHERE `user_id`=11