backend/models/UsuarioPermiso.php

SELECT * FROM `permiso`
---
    public static function getPermisoLista()
    {
        $dropciones = Permiso::find()->asArray()->all();

SELECT * FROM `user`
---
    public function getUserLista() {

        $users = User::find()->all();