frontend/models/PasswordResetRequestForm.php

SELECT * FROM `user` WHERE (`estado_id`=1) AND (`email`='fernandopoot247@gmail.com')
UPDATE `user` SET `password_reset_token`='Ly05jCKNhC7PFS_AlqmVxlQwOQpOO6Bz_1729472507', `updated_at`=NOW() WHERE `id`=11
---
    public function sendEmail()
    {
        /* @var $user User */
        $user = User::findOne([
            'estado_id' => ValorHelpers::getEstadoId('Activo'),
            'email' => $this->email,
        ]);

        if (!$user) {
            return false;
        }

        if (!User::isPasswordResetTokenValid($user->password_reset_token)) {
            $user->generatePasswordResetToken();
            if (!$user->save()) {