frontend/models/ResendVerificationEmailForm.php

    public function sendEmail()
    {
        $user = User::findOne([
            'email' => $this->email,
            'estado_id' => User::ESTADO_PENDIENTE
        ]);
---
SELECT * FROM `user` WHERE (`email`='fernando75@hotmail.com') AND (`estado_id`=2)